zhuolinho/minix/std/1.7.0/man/man8/partition.8
.TH PARTITION 8
.SH NAME
partition \- make a partition table
.SH SYNOPSIS
.B partition
.RB [ \-m ]
.I device
[\fItype\fP:]\fIsize\fP[\fB+*\fP] ...
.SH DESCRIPTION
.B Partition
makes a partition table on
.I device
using the types and sizes given.  It may be used in combination with
.BR repartition (8)
for automatic installation of Minix.  
.PP
You may give up to four \fItype\fP:\fIsize\fP[\fB+*\fP] specifications
for the partitions.  You may also specify holes before, between, and after
the partitions.  A hole differs from a partition specification by not having
a type.
.PP
The first hole is by default 1 sector to make space for the primary
bootstrap and the partition table.  The other holes are 0.
.PP
The
.I type
field is the type of the partitition in hexadecimal.  The
.I size
field is the partition's size in sectors.  The
.B +
or
.B *
may optionally be added to indicate that the partition must be expanded
to contain any leftover space on the device or to mark the partition active.
.PP
Partitions are padded out to cylinder boundaries, except for the first one,
it starts on track 1.  Some operating systems care about this.  Minix and
MS-DOS do not.
.SH OPTIONS
.TP
.B \-m
Minix only, no need to pad partitions.  This is the default for subpartition
tables.
.SH EXAMPLE
.B "partition /dev/hd0 01:16384 81:40000 81:2880* 06:20000+"
.PP
Partitions disk 0 into an 8 Mb DOS partition, 20 Mb Minix /usr, 1.44 Mb Minix
/ (active), and a DOS partition of at least 10 Mb at the end of the disk.
(06:0+ would have been ok too, it's just a sanity check.)
.SH "SEE ALSO"
.BR hd (4),
.BR part (8),
.BR repartition (8).
.SH AUTHOR
Kees J. Bot (kjb@cs.vu.nl)
